# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных
# координат точек в этой четверти (x и y).

def Input():
    c = int(input("Введите номер четверти 1,2,3 или 4: "))
    return c


def Definition(t):
    if t == 1:
        print("Возможный диапазон: x>0; y>0")
    elif t == 2:
        print("Возможный диапазон: x<0; y>0")
    elif t == 3:
        print("Возможный диапазон: x<0; y<0")
    elif t == 4:
        print("Возможный диапазон: x>0; y<0")


a = Input()
Definition(a)
