# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли 
# этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

a = int(input("Введите номер дня недели "))

if a>5 and a<8:
    print(f'{a} --> да, Weekend')
elif a>0 and a<6:
    print(f'{a} --> нет, Workday')
else:
    print("Input correct number: form 1 to 7")
    a = int(input("Введите номер дня недели "))

